Revit 2026 API

# RevitAPIPostEventArgs Class

---

The class is used as a base class for arguments of any post-event.

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitAPIEventArgs Autodesk.Revit.DB.EventsRevitAPIPostEventArgs Autodesk.Revit.DB.EventsDocumentClosedEventArgs Autodesk.Revit.DB.EventsRevitAPIPostDocEventArgs

**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RevitAPIPostEventArgs : RevitAPIEventArgs
```
```vb
Public Class RevitAPIPostEventArgs
	Inherits RevitAPIEventArgs
```
```cpp
public ref class RevitAPIPostEventArgs : public RevitAPIEventArgs
```
```fsharp
type RevitAPIPostEventArgs =
    class
        inherit RevitAPIEventArgs
    end
```

The RevitAPIPostEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |
|  | Status | Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler). |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from RevitAPIEventArgs) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCancelled | Indicates whether the event is being cancelled. (Inherited from RevitAPIEventArgs) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

A post-event is the event raised after execution of the process that was related with the event.

#### Reference

Autodesk.Revit.DB.Events Namespace